saaj/src/main/resources/com/sun/ts/tests/saaj/api/jakarta_xml_soap/SOAPPart/contentRoot/attach.xml

<?xml version='1.0' encoding='UTF-8'?>
<!--

    Copyright (c) 2018 Oracle and/or its affiliates. All rights reserved.

    This program and the accompanying materials are made available under the
    terms of the Eclipse Public License v. 2.0, which is available at
    http://www.eclipse.org/legal/epl-2.0.

    This Source Code may also be made available under the following Secondary
    Licenses when the conditions for such availability set forth in the
    Eclipse Public License v. 2.0 are satisfied: GNU General Public License,
    version 2 with the GNU Classpath Exception, which is available at
    https://www.gnu.org/software/classpath/license.html.

    SPDX-License-Identifier: EPL-2.0 OR GPL-2.0 WITH Classpath-exception-2.0

-->

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
    <pre:Header1 env:mustUnderstand="1" xmlns:pre="http://myuri.org/">This is Header1</pre:Header1>
    <pre:Header2 env:mustUnderstand="0" xmlns:pre="http://myuri.org/">This is Header2</pre:Header2>
    <pre:Header3 env:mustUnderstand="1" xmlns:pre="http://myuri.org/">This is Header3</pre:Header3>
    <pre:Header4 env:mustUnderstand="0" xmlns:pre="http://myuri.org/">This is Header4</pre:Header4>
  </env:Header>
  <env:Body>
    <pre:Body1 xmlns:pre="http://myuri.org/">
      <pre:Child1>This is Child1</pre:Child1>
      <pre:Child2>This is Child2</pre:Child2>
    </pre:Body1>
  </env:Body>
</env:Envelope>
